In [6]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('Fontes/bikes.db')

In [3]:
query = '''
SELECT name, sql
FROM sqlite_master
WHERE type == 'table'
'''

In [4]:
for name, sql in conn.execute(query):
    print(name)
    print(sql)

bike_rides
CREATE TABLE bike_rides(
  year INT,
  month INT,
  day INT,
  trip_id INT,
  bike_id INT,
  duration INT
)

In [5]:
conn.execute('SELECT MAX(year), MIN(year) FROM bike_rides').fetchall()

[(2017, 2016)]

In [8]:
query = '''
SELECT year, month, duration
FROM bike_rides
WHERE year == 2016 or year == 2017
'''

In [9]:
df = pd.read_sql(query, conn)

In [10]:
df.sample(10)

        year  month  duration
261530  2016      1         6
354819  2017     11        34
225189  2016      3        15
116703  2016     10        18
98788   2016     11         6
360557  2017     11         9
24261   2017      3        55
84633   2017      1         5
321213  2017      9         9
75438   2017      5        38

In [11]:
df.groupby(['year', 'month'])['duration'].median()

year  month
2016  1        14.0
      2        15.0
      3        14.0
      5        15.0
      6        14.0
      7        15.0
      8        13.0
      9        15.0
      10       16.0
      11       14.0
2017  1        14.0
      2        16.0
      3        14.0
      4        18.0
      5        18.0
      6        16.0
      7        16.0
      8        13.0
      9        17.0
      10       16.0
      11       18.0
      12       16.0
Name: duration, dtype: float64